### 데이터 합치기

### Do it! 실습 | 가로로 합치기

In [2]:
import pandas as pd

In [3]:
# 중간고사 데이터 만들기
test1 = pd.DataFrame({'id' : [1,2,3,4,5],
                      'midterm' : [60, 80, 70, 90, 85]})

# 기말고사 데이터 만들기
test2 = pd.DataFrame({'id' : [1,2,3,4,5],
                      'final' : [70, 83, 65, 95, 80]})

In [4]:
test1

   id  midterm
0   1       60
1   2       80
2   3       70
3   4       90
4   5       85

In [5]:
test2

   id  final
0   1     70
1   2     83
2   3     65
3   4     95
4   5     80

In [6]:
# id를 기준으로 합쳐서 tota에 할당
total = pd.merge(test1, test2, how='left', on='id')
total

   id  midterm  final
0   1       60     70
1   2       80     83
2   3       70     65
3   4       90     95
4   5       85     80